/*Вам необхідно вказати, яким буде результат операції 
та описати крок за кроком у вигляді коментарів, як відбувається
 перетворення в кожному прикладі:
 */



'number' + 3 + 3; //'number33'
/*
1. 'number' + 3 = 'number3' - конкатенація
2. 'number3' + 3 = 'number33' - конкатенація
*/

null + 3; // NaN
/*
1. Математичні операції з типом даних null будуть дорівнювати NaN (Not a number)
*/

5 && "qwerty"; //'qwerty'
/*
оператор && перевіряє булеве значення даних, і повертає останню якщо всі вони будуть true
5 - true
"qwerty" - true
*/

+'40' + +'2' + "hillel"; // '42hillel'
/*
1. +'40' = 40 - унарний + перетворить стрінг на інт
2. 40 + +'2' = 42 - теж саме буде з '2' тому що перед нею стоїть унарний +, вираз буде 40 + 2
3. 42 + 'hillel' = '42hillel' - конкатенація
*/

'10' - 5 === 6; //false
/*
1.при математичній операції js буде перевіряти (крім конкатенації) стрінгу, якщо в стрінгі буде число,
воно конвертуватиметься в інт
2. '10' - 5 = 5
3. 5 === 6 - false (5 не дорівнює 6)
*/

true + false; // 1
/*
1. true та false конвертуються в цифри
2. 1 + 0 = 1
*/

'4px' - 3; // NaN
/*
js не зміг конвертувати '4px' в число тому '4px' - 3 = NaN
*/

'4' - 3; // 1
/*
'4' конвертується в інт
4 - 3 = 1
*/

'6' + 3 ** 0; // '61'
/*
1. Спочатку виконається піднесення в степінь 3 ** 0 = 1
2. '6' + 1 = '61' - конкатенація
*/

12 / '6'; // 2
/*
1.'6' конвертується в стрінг
2. 12 / 6 = 2
*/

'10' + (5 === 6); // '10false'
/*
1. Спочатку виконається операція в дужках 
2. 5===6 - false
3. '10' + false = '10fasle' - конкатенація
*/


null == ''; // true
/*
1. null = false
2. '' = false
3. false == false - true
*/

3 ** (9 / 3); // 27
/*
1. Спочатку виконається ділення в дужках 9/3 = 3
2. Далі буде піднесення до степені 3 ** 3 = 27
*/

!!'false' == !!'true'; // true
/*
1. 'false' - не порожня стрінга тому true. !'fasle' - false, !false - true
2. 'true' - не порожня стрінга тому true. !'true' - false, !false - true
3. true == true - true
*/


0 || '0' && 1; // 1
/*
1. 0 || '0'. 0 - fasle OR '0' - true. 
2. true && 1. true && true 
3. Скорочене рівняння буде '0' && 1. Оператор && поверне 1
*/

(+null == false) < 1; // true
/*
1. Унарний + конвертує null в 0 (0 == false), false == false - true
2. true < 1 - true
*/

false && true || true; // true
/*
1. false && true - false
2. fasle || true - true
*/

false && (false || true); //false
/*
1. Спочатку виконається операція в дужках false || true - true
2. false && true - false
*/

(+null == false) < 1 ** 5; // true
/*
1. Спочатку виконається операція в дужках Унарний + конвертує null в 0 (0 == false), false == false - true
2. Далі виконається піднесення до степені 1**5 = 1
3. true < 1 - true
*/